MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_lfss.h
typedef struct {
  __IO uint32_t TIOCTL[16];                        /* !< (@ 0x00001200) Tamper I/O Control Register */
       uint32_t RESERVED0[16];
  __IO uint32_t TOUT3_0;                           /* !< (@ 0x00001280) Tamper Output 3 to 0 */
  __IO uint32_t TOUT7_4;                           /* !< (@ 0x00001284) Tamper Output 7 to 4 */
  __IO uint32_t TOUT11_8;                          /* !< (@ 0x00001288) Tamper Output 11 to 8 */
  __IO uint32_t TOUT15_12;                         /* !< (@ 0x0000128C) Tamper Output 15 to 12 */
  __IO uint32_t TOE3_0;                            /* !< (@ 0x00001290) Tamper Output Enable 3 to 0 */
  __IO uint32_t TOE7_4;                            /* !< (@ 0x00001294) Tamper Output Enable 7 to 4 */
  __IO uint32_t TOE11_8;                           /* !< (@ 0x00001298) Tamper Output Enable 7 to 4 */
  __IO uint32_t TOE15_12;                          /* !< (@ 0x0000129C) Tamper Output Enable 7 to 4 */
  __I  uint32_t TIN3_0;                            /* !< (@ 0x000012A0) Tamper Input Register */
  __I  uint32_t TIN7_4;                            /* !< (@ 0x000012A4) Tamper Input Register */
  __I  uint32_t TIN11_8;                           /* !< (@ 0x000012A8) Tamper Input Register */
  __I  uint32_t TIN15_12;                          /* !< (@ 0x000012AC) Tamper Input Register */
       uint32_t RESERVED1[4];
  __IO uint32_t HEARTBEAT;                         /* !< (@ 0x000012C0) Heartbeat Register */
       uint32_t RESERVED2[14];
  __IO uint32_t TIOLOCK;                           /* !< (@ 0x000012FC) Tamper I/O lock register */
} LFSS_IPSPECIFIC_TIO_Regs;

/*@}*/ /* end of group LFSS_IPSPECIFIC_TIO */

/** @addtogroup LFSS_IPSPECIFIC_RTC
  @{
*/

typedef struct {
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001100) RTC Clock Control Register */
  __IO uint32_t DBGCTL;                            /* !< (@ 0x00001104) RTC Module Debug Control Register */
  __IO uint32_t CTL;                               /* !< (@ 0x00001108) RTC Control Register */
  __I  uint32_t STA;                               /* !< (@ 0x0000110C) RTC Status Register */
  __IO uint32_t CAL;                               /* !< (@ 0x00001110) RTC Clock Offset Calibration Register */
  __IO uint32_t TCMP;                              /* !< (@ 0x00001114) RTC Temperature Compensation Register */
  __IO uint32_t SEC;                               /* !< (@ 0x00001118) RTC Seconds Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t MIN;                               /* !< (@ 0x0000111C) RTC Minutes Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t HOUR;                              /* !< (@ 0x00001120) RTC Hours Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t DAY;                               /* !< (@ 0x00001124) RTC Day Of Week / Month Register - Calendar Mode
                                                      With Binary / BCD Format */
  __IO uint32_t MON;                               /* !< (@ 0x00001128) RTC Month Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t YEAR;                              /* !< (@ 0x0000112C) RTC Year Register - Calendar Mode With Binary /
                                                      BCD Format */
  __IO uint32_t A1MIN;                             /* !< (@ 0x00001130) RTC Minute Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A1HOUR;                            /* !< (@ 0x00001134) RTC Hours Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A1DAY;                             /* !< (@ 0x00001138) RTC Alarm Day Of Week / Month Register - Calendar
                                                      Mode With Binary / BCD Format */
  __IO uint32_t A2MIN;                             /* !< (@ 0x0000113C) RTC Minute Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A2HOUR;                            /* !< (@ 0x00001140) RTC Hours Alarm Register - Calendar Mode With
                                                      Binary / BCD Format */
  __IO uint32_t A2DAY;                             /* !< (@ 0x00001144) RTC Alarm Day Of Week / Month Register - Calendar
                                                      Mode With Binary / BCD Format */
  __IO uint32_t PSCTL;                             /* !< (@ 0x00001148) RTC Prescale Timer 0/1 Control Register */
  __IO uint32_t EXTPSCTL;                          /* !< (@ 0x0000114C) RTC Prescale Timer 2 Control Register */
  __I  uint32_t TSSEC;                             /* !< (@ 0x00001150) Time Stamp Seconds Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSMIN;                             /* !< (@ 0x00001154) Time Stamp Minutes Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSHOUR;                            /* !< (@ 0x00001158) Time Stamp Hours Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSDAY;                             /* !< (@ 0x0000115C) Time Stamp Day Of Week / MonthRegister - Calendar
                                                      Mode With Binary / BCD Format */
  __I  uint32_t TSMON;                             /* !< (@ 0x00001160) Time Stamp Month Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSYEAR;                            /* !< (@ 0x00001164) Time Stamp Years Register - Calendar Mode With
                                                      Binary / BCD Format */
  __I  uint32_t TSSTAT;                            /* !< (@ 0x00001168) Time Stamp Status Register */
  __IO uint32_t TSCTL;                             /* !< (@ 0x0000116C) Time Stamp Control Register */
  __O  uint32_t TSCLR;                             /* !< (@ 0x00001170) Time Stamp Clear Register */
       uint32_t RESERVED0[31];
  __IO uint32_t LFSSRST;                           /* !< (@ 0x000011F0) Low frequency sub-system reset request */
       uint32_t RESERVED1[2];
  __IO uint32_t RTCLOCK;                           /* !< (@ 0x000011FC) Real time clock lock register */
} LFSS_IPSPECIFIC_RTC_Regs;

/*@}*/ /* end of group LFSS_IPSPECIFIC_RTC */

