MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMWPROT1 Bits */
/* LFSS_SPMWPROT1[KEY] Bits */
#define LFSS_SPMWPROT1_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT1_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-09-30
                                                                                    this register */
#define LFSS_SPMWPROT1_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-09-30 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT1[WP_7_3] Bits */
#define LFSS_SPMWPROT1_WP_7_3_OFS                (15)                            /* !< WP_7_3 Offset */
#define LFSS_SPMWPROT1_WP_7_3_MASK               ((uint32_t)0x00008000U)         /* !< write protect SPMEM7 - DATA3 */
#define LFSS_SPMWPROT1_WP_7_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_7_3_READONLY           ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_7_2] Bits */
#define LFSS_SPMWPROT1_WP_7_2_OFS                (14)                            /* !< WP_7_2 Offset */
#define LFSS_SPMWPROT1_WP_7_2_MASK               ((uint32_t)0x00004000U)         /* !< write protect SPMEM7 - DATA2 */
#define LFSS_SPMWPROT1_WP_7_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_7_2_READONLY           ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_7_1] Bits */
#define LFSS_SPMWPROT1_WP_7_1_OFS                (13)                            /* !< WP_7_1 Offset */
#define LFSS_SPMWPROT1_WP_7_1_MASK               ((uint32_t)0x00002000U)         /* !< write protect SPMEM7 - DATA1 */
#define LFSS_SPMWPROT1_WP_7_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_7_1_READONLY           ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_7_0] Bits */
#define LFSS_SPMWPROT1_WP_7_0_OFS                (12)                            /* !< WP_7_0 Offset */
#define LFSS_SPMWPROT1_WP_7_0_MASK               ((uint32_t)0x00001000U)         /* !< write protect SPMEM7 - DATA0 */
#define LFSS_SPMWPROT1_WP_7_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_7_0_READONLY           ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_6_3] Bits */
#define LFSS_SPMWPROT1_WP_6_3_OFS                (11)                            /* !< WP_6_3 Offset */
#define LFSS_SPMWPROT1_WP_6_3_MASK               ((uint32_t)0x00000800U)         /* !< write protect SPMEM6 - DATA3 */
#define LFSS_SPMWPROT1_WP_6_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_6_3_READONLY           ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_6_2] Bits */
#define LFSS_SPMWPROT1_WP_6_2_OFS                (10)                            /* !< WP_6_2 Offset */
#define LFSS_SPMWPROT1_WP_6_2_MASK               ((uint32_t)0x00000400U)         /* !< write protect SPMEM6 - DATA2 */
#define LFSS_SPMWPROT1_WP_6_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_6_2_READONLY           ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_6_1] Bits */
#define LFSS_SPMWPROT1_WP_6_1_OFS                (9)                             /* !< WP_6_1 Offset */
#define LFSS_SPMWPROT1_WP_6_1_MASK               ((uint32_t)0x00000200U)         /* !< write protect SPMEM6 - DATA1 */
#define LFSS_SPMWPROT1_WP_6_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_6_1_READONLY           ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_6_0] Bits */
#define LFSS_SPMWPROT1_WP_6_0_OFS                (8)                             /* !< WP_6_0 Offset */
#define LFSS_SPMWPROT1_WP_6_0_MASK               ((uint32_t)0x00000100U)         /* !< write protect SPMEM6 - DATA0 */
#define LFSS_SPMWPROT1_WP_6_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_6_0_READONLY           ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_5_3] Bits */
#define LFSS_SPMWPROT1_WP_5_3_OFS                (7)                             /* !< WP_5_3 Offset */
#define LFSS_SPMWPROT1_WP_5_3_MASK               ((uint32_t)0x00000080U)         /* !< write protect SPMEM5 - DATA3 */
#define LFSS_SPMWPROT1_WP_5_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_5_3_READONLY           ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_5_2] Bits */
#define LFSS_SPMWPROT1_WP_5_2_OFS                (6)                             /* !< WP_5_2 Offset */
#define LFSS_SPMWPROT1_WP_5_2_MASK               ((uint32_t)0x00000040U)         /* !< write protect SPMEM5 - DATA2 */
#define LFSS_SPMWPROT1_WP_5_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_5_2_READONLY           ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_5_1] Bits */
#define LFSS_SPMWPROT1_WP_5_1_OFS                (5)                             /* !< WP_5_1 Offset */
#define LFSS_SPMWPROT1_WP_5_1_MASK               ((uint32_t)0x00000020U)         /* !< write protect SPMEM5 - DATA1 */
#define LFSS_SPMWPROT1_WP_5_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_5_1_READONLY           ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_5_0] Bits */
#define LFSS_SPMWPROT1_WP_5_0_OFS                (4)                             /* !< WP_5_0 Offset */
#define LFSS_SPMWPROT1_WP_5_0_MASK               ((uint32_t)0x00000010U)         /* !< write protect SPMEM5 - DATA0 */
#define LFSS_SPMWPROT1_WP_5_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_5_0_READONLY           ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_4_3] Bits */
#define LFSS_SPMWPROT1_WP_4_3_OFS                (3)                             /* !< WP_4_3 Offset */
#define LFSS_SPMWPROT1_WP_4_3_MASK               ((uint32_t)0x00000008U)         /* !< write protect SPMEM4 - DATA3 */
#define LFSS_SPMWPROT1_WP_4_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_4_3_READONLY           ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_4_2] Bits */
#define LFSS_SPMWPROT1_WP_4_2_OFS                (2)                             /* !< WP_4_2 Offset */
#define LFSS_SPMWPROT1_WP_4_2_MASK               ((uint32_t)0x00000004U)         /* !< write protect SPMEM4 - DATA2 */
#define LFSS_SPMWPROT1_WP_4_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_4_2_READONLY           ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_4_1] Bits */
#define LFSS_SPMWPROT1_WP_4_1_OFS                (1)                             /* !< WP_4_1 Offset */
#define LFSS_SPMWPROT1_WP_4_1_MASK               ((uint32_t)0x00000002U)         /* !< write protect SPMEM4 - DATA1 */
#define LFSS_SPMWPROT1_WP_4_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_4_1_READONLY           ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT1[WP_4_0] Bits */
#define LFSS_SPMWPROT1_WP_4_0_OFS                (0)                             /* !< WP_4_0 Offset */
#define LFSS_SPMWPROT1_WP_4_0_MASK               ((uint32_t)0x00000001U)         /* !< write protect SPMEM4 - DATA0 */
#define LFSS_SPMWPROT1_WP_4_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT1_WP_4_0_READONLY           ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

/* LFSS_SPMWPROT2 Bits */
/* LFSS_SPMWPROT2[KEY] Bits */
#define LFSS_SPMWPROT2_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT2_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-09-30
                                                                                    this register */
#define LFSS_SPMWPROT2_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-09-30 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT2[WP_11_3] Bits */
#define LFSS_SPMWPROT2_WP_11_3_OFS               (15)                            /* !< WP_11_3 Offset */
#define LFSS_SPMWPROT2_WP_11_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM11 - DATA3 */
#define LFSS_SPMWPROT2_WP_11_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_11_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_11_2] Bits */
#define LFSS_SPMWPROT2_WP_11_2_OFS               (14)                            /* !< WP_11_2 Offset */
#define LFSS_SPMWPROT2_WP_11_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM11 - DATA2 */
#define LFSS_SPMWPROT2_WP_11_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_11_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_11_1] Bits */
#define LFSS_SPMWPROT2_WP_11_1_OFS               (13)                            /* !< WP_11_1 Offset */
#define LFSS_SPMWPROT2_WP_11_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM11 - DATA1 */
#define LFSS_SPMWPROT2_WP_11_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_11_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_11_0] Bits */
#define LFSS_SPMWPROT2_WP_11_0_OFS               (12)                            /* !< WP_11_0 Offset */
#define LFSS_SPMWPROT2_WP_11_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM11 - DATA0 */
#define LFSS_SPMWPROT2_WP_11_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_11_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_10_3] Bits */
#define LFSS_SPMWPROT2_WP_10_3_OFS               (11)                            /* !< WP_10_3 Offset */
#define LFSS_SPMWPROT2_WP_10_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM10 - DATA3 */
#define LFSS_SPMWPROT2_WP_10_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_10_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_10_2] Bits */
#define LFSS_SPMWPROT2_WP_10_2_OFS               (10)                            /* !< WP_10_2 Offset */
#define LFSS_SPMWPROT2_WP_10_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM610- DATA2 */
#define LFSS_SPMWPROT2_WP_10_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_10_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_10_1] Bits */
#define LFSS_SPMWPROT2_WP_10_1_OFS               (9)                             /* !< WP_10_1 Offset */
#define LFSS_SPMWPROT2_WP_10_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM10 - DATA1 */
#define LFSS_SPMWPROT2_WP_10_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_10_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_10_0] Bits */
#define LFSS_SPMWPROT2_WP_10_0_OFS               (8)                             /* !< WP_10_0 Offset */
#define LFSS_SPMWPROT2_WP_10_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM10 - DATA0 */
#define LFSS_SPMWPROT2_WP_10_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_10_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_9_3] Bits */
#define LFSS_SPMWPROT2_WP_9_3_OFS                (7)                             /* !< WP_9_3 Offset */
#define LFSS_SPMWPROT2_WP_9_3_MASK               ((uint32_t)0x00000080U)         /* !< write protect SPMEM9 - DATA3 */
#define LFSS_SPMWPROT2_WP_9_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_9_3_READONLY           ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_9_2] Bits */
#define LFSS_SPMWPROT2_WP_9_2_OFS                (6)                             /* !< WP_9_2 Offset */
#define LFSS_SPMWPROT2_WP_9_2_MASK               ((uint32_t)0x00000040U)         /* !< write protect SPMEM9 - DATA2 */
#define LFSS_SPMWPROT2_WP_9_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_9_2_READONLY           ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_9_1] Bits */
#define LFSS_SPMWPROT2_WP_9_1_OFS                (5)                             /* !< WP_9_1 Offset */
#define LFSS_SPMWPROT2_WP_9_1_MASK               ((uint32_t)0x00000020U)         /* !< write protect SPMEM9 - DATA1 */
#define LFSS_SPMWPROT2_WP_9_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_9_1_READONLY           ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_9_0] Bits */
#define LFSS_SPMWPROT2_WP_9_0_OFS                (4)                             /* !< WP_9_0 Offset */
#define LFSS_SPMWPROT2_WP_9_0_MASK               ((uint32_t)0x00000010U)         /* !< write protect SPMEM9 - DATA0 */
#define LFSS_SPMWPROT2_WP_9_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_9_0_READONLY           ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_8_3] Bits */
#define LFSS_SPMWPROT2_WP_8_3_OFS                (3)                             /* !< WP_8_3 Offset */
#define LFSS_SPMWPROT2_WP_8_3_MASK               ((uint32_t)0x00000008U)         /* !< write protect SPMEM8 - DATA3 */
#define LFSS_SPMWPROT2_WP_8_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_8_3_READONLY           ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_8_2] Bits */
#define LFSS_SPMWPROT2_WP_8_2_OFS                (2)                             /* !< WP_8_2 Offset */
#define LFSS_SPMWPROT2_WP_8_2_MASK               ((uint32_t)0x00000004U)         /* !< write protect SPMEM8 - DATA2 */
#define LFSS_SPMWPROT2_WP_8_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_8_2_READONLY           ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_8_1] Bits */
#define LFSS_SPMWPROT2_WP_8_1_OFS                (1)                             /* !< WP_8_1 Offset */
#define LFSS_SPMWPROT2_WP_8_1_MASK               ((uint32_t)0x00000002U)         /* !< write protect SPMEM8 - DATA1 */
#define LFSS_SPMWPROT2_WP_8_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_8_1_READONLY           ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT2[WP_8_0] Bits */
#define LFSS_SPMWPROT2_WP_8_0_OFS                (0)                             /* !< WP_8_0 Offset */
#define LFSS_SPMWPROT2_WP_8_0_MASK               ((uint32_t)0x00000001U)         /* !< write protect SPMEM8 - DATA0 */
#define LFSS_SPMWPROT2_WP_8_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT2_WP_8_0_READONLY           ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

