MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_TSCTL Bits */
/* LFSS_TSCTL[TSTIOEN0] Bits */
#define LFSS_TSCTL_TSTIOEN0_OFS                  (0)                             /* !< TSTIOEN0 Offset */
#define LFSS_TSCTL_TSTIOEN0_MASK                 ((uint32_t)0x00000001U)         /* !< Time Stamp by Tamper I/O 0 enable */
#define LFSS_TSCTL_TSTIOEN0_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN0_ENABLE               ((uint32_t)0x00000001U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN1] Bits */
#define LFSS_TSCTL_TSTIOEN1_OFS                  (1)                             /* !< TSTIOEN1 Offset */
#define LFSS_TSCTL_TSTIOEN1_MASK                 ((uint32_t)0x00000002U)         /* !< Time Stamp by Tamper I/O 1 enable */
#define LFSS_TSCTL_TSTIOEN1_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN1_ENABLE               ((uint32_t)0x00000002U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN2] Bits */
#define LFSS_TSCTL_TSTIOEN2_OFS                  (2)                             /* !< TSTIOEN2 Offset */
#define LFSS_TSCTL_TSTIOEN2_MASK                 ((uint32_t)0x00000004U)         /* !< Time Stamp by Tamper I/O 2 enable */
#define LFSS_TSCTL_TSTIOEN2_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN2_ENABLE               ((uint32_t)0x00000004U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN3] Bits */
#define LFSS_TSCTL_TSTIOEN3_OFS                  (3)                             /* !< TSTIOEN3 Offset */
#define LFSS_TSCTL_TSTIOEN3_MASK                 ((uint32_t)0x00000008U)         /* !< Time Stamp by Tamper I/O 3 enable */
#define LFSS_TSCTL_TSTIOEN3_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN3_ENABLE               ((uint32_t)0x00000008U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN4] Bits */
#define LFSS_TSCTL_TSTIOEN4_OFS                  (4)                             /* !< TSTIOEN4 Offset */
#define LFSS_TSCTL_TSTIOEN4_MASK                 ((uint32_t)0x00000010U)         /* !< Time Stamp by Tamper I/O 4 enable */
#define LFSS_TSCTL_TSTIOEN4_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN4_ENABLE               ((uint32_t)0x00000010U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN5] Bits */
#define LFSS_TSCTL_TSTIOEN5_OFS                  (5)                             /* !< TSTIOEN5 Offset */
#define LFSS_TSCTL_TSTIOEN5_MASK                 ((uint32_t)0x00000020U)         /* !< Time Stamp by Tamper I/O 5 enable */
#define LFSS_TSCTL_TSTIOEN5_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN5_ENABLE               ((uint32_t)0x00000020U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN6] Bits */
#define LFSS_TSCTL_TSTIOEN6_OFS                  (6)                             /* !< TSTIOEN6 Offset */
#define LFSS_TSCTL_TSTIOEN6_MASK                 ((uint32_t)0x00000040U)         /* !< Time Stamp by Tamper I/O 6 enable */
#define LFSS_TSCTL_TSTIOEN6_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN6_ENABLE               ((uint32_t)0x00000040U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN7] Bits */
#define LFSS_TSCTL_TSTIOEN7_OFS                  (7)                             /* !< TSTIOEN7 Offset */
#define LFSS_TSCTL_TSTIOEN7_MASK                 ((uint32_t)0x00000080U)         /* !< Time Stamp by Tamper I/O 7 enable */
#define LFSS_TSCTL_TSTIOEN7_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN7_ENABLE               ((uint32_t)0x00000080U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN8] Bits */
#define LFSS_TSCTL_TSTIOEN8_OFS                  (8)                             /* !< TSTIOEN8 Offset */
#define LFSS_TSCTL_TSTIOEN8_MASK                 ((uint32_t)0x00000100U)         /* !< Time Stamp by Tamper I/O 8 enable */
#define LFSS_TSCTL_TSTIOEN8_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN8_ENABLE               ((uint32_t)0x00000100U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN9] Bits */
#define LFSS_TSCTL_TSTIOEN9_OFS                  (9)                             /* !< TSTIOEN9 Offset */
#define LFSS_TSCTL_TSTIOEN9_MASK                 ((uint32_t)0x00000200U)         /* !< Time Stamp by Tamper I/O 9 enable */
#define LFSS_TSCTL_TSTIOEN9_DISABLE              ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN9_ENABLE               ((uint32_t)0x00000200U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN10] Bits */
#define LFSS_TSCTL_TSTIOEN10_OFS                 (10)                            /* !< TSTIOEN10 Offset */
#define LFSS_TSCTL_TSTIOEN10_MASK                ((uint32_t)0x00000400U)         /* !< Time Stamp by Tamper I/O 10 enable */
#define LFSS_TSCTL_TSTIOEN10_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN10_ENABLE              ((uint32_t)0x00000400U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN11] Bits */
#define LFSS_TSCTL_TSTIOEN11_OFS                 (11)                            /* !< TSTIOEN11 Offset */
#define LFSS_TSCTL_TSTIOEN11_MASK                ((uint32_t)0x00000800U)         /* !< Time Stamp by Tamper I/O 11 enable */
#define LFSS_TSCTL_TSTIOEN11_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN11_ENABLE              ((uint32_t)0x00000800U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN12] Bits */
#define LFSS_TSCTL_TSTIOEN12_OFS                 (12)                            /* !< TSTIOEN12 Offset */
#define LFSS_TSCTL_TSTIOEN12_MASK                ((uint32_t)0x00001000U)         /* !< Time Stamp by Tamper I/O 12 enable */
#define LFSS_TSCTL_TSTIOEN12_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN12_ENABLE              ((uint32_t)0x00001000U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN13] Bits */
#define LFSS_TSCTL_TSTIOEN13_OFS                 (13)                            /* !< TSTIOEN13 Offset */
#define LFSS_TSCTL_TSTIOEN13_MASK                ((uint32_t)0x00002000U)         /* !< Time Stamp by Tamper I/O 13 enable */
#define LFSS_TSCTL_TSTIOEN13_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN13_ENABLE              ((uint32_t)0x00002000U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN14] Bits */
#define LFSS_TSCTL_TSTIOEN14_OFS                 (14)                            /* !< TSTIOEN14 Offset */
#define LFSS_TSCTL_TSTIOEN14_MASK                ((uint32_t)0x00004000U)         /* !< Time Stamp by Tamper I/O 14 enable */
#define LFSS_TSCTL_TSTIOEN14_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN14_ENABLE              ((uint32_t)0x00004000U)         /* !< function enabled */
/* LFSS_TSCTL[TSTIOEN15] Bits */
#define LFSS_TSCTL_TSTIOEN15_OFS                 (15)                            /* !< TSTIOEN15 Offset */
#define LFSS_TSCTL_TSTIOEN15_MASK                ((uint32_t)0x00008000U)         /* !< Time Stamp by Tamper I/O 15 enable */
#define LFSS_TSCTL_TSTIOEN15_DISABLE             ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSTIOEN15_ENABLE              ((uint32_t)0x00008000U)         /* !< function enabled */
/* LFSS_TSCTL[TSVDDEN] Bits */
#define LFSS_TSCTL_TSVDDEN_OFS                   (16)                            /* !< TSVDDEN Offset */
#define LFSS_TSCTL_TSVDDEN_MASK                  ((uint32_t)0x00010000U)         /* !< Time Stamp by VDD Loss detection
                                                                                    enable */
#define LFSS_TSCTL_TSVDDEN_DISABLE               ((uint32_t)0x00000000U)         /* !< function disabled */
#define LFSS_TSCTL_TSVDDEN_ENABLE                ((uint32_t)0x00010000U)         /* !< function enabled */
/* LFSS_TSCTL[TSCAPTURE] Bits */
#define LFSS_TSCTL_TSCAPTURE_OFS                 (20)                            /* !< TSCAPTURE Offset */
#define LFSS_TSCTL_TSCAPTURE_MASK                ((uint32_t)0x00100000U)         /* !< Defines the capture method of the
                                                                                    RTC timestamp when a time stamp event
                                                                                    occurens. */
#define LFSS_TSCTL_TSCAPTURE_FIRST               ((uint32_t)0x00000000U)         /* !< Time stamp holds RTC capture at
                                                                                    first occurrence of time stamp event. */
#define LFSS_TSCTL_TSCAPTURE_LAST                ((uint32_t)0x00100000U)         /* !< Time stamp holds RTC capture at
                                                                                    last occurrence of time stamp event. */
/* LFSS_TSCTL[KEY] Bits */
#define LFSS_TSCTL_KEY_OFS                       (24)                            /* !< KEY Offset */
#define LFSS_TSCTL_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xC5) to up2025-09-30
                                                                                    this register */
#define LFSS_TSCTL_KEY_UNLOCK_W                  ((uint32_t)0xC5000000U)         /* !< This field must be written with
                                                                                    0xC5 to be able to clear any of the
                                                                                    enable bits */

/* LFSS_TSCLR Bits */
/* LFSS_TSCLR[CLR] Bits */
#define LFSS_TSCLR_CLR_OFS                       (0)                             /* !< CLR Offset */
#define LFSS_TSCLR_CLR_MASK                      ((uint32_t)0x00000001U)         /* !< Clear time stamp and status
                                                                                    register. */
#define LFSS_TSCLR_CLR_NO_EFFECT                 ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LFSS_TSCLR_CLR_CLR                       ((uint32_t)0x00000001U)         /* !< clear time stamp event */
/* LFSS_TSCLR[KEY] Bits */
#define LFSS_TSCLR_KEY_OFS                       (24)                            /* !< KEY Offset */
#define LFSS_TSCLR_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE2) to up2025-09-30
                                                                                    this register */
#define LFSS_TSCLR_KEY_UNLOCK_W                  ((uint32_t)0xE2000000U)         /* !< This field must be written with
                                                                                    0xE2 to be able to clear any of the
                                                                                    enable bits */

/* LFSS_LFSSRST Bits */
/* LFSS_LFSSRST[VBATPOR] Bits */
#define LFSS_LFSSRST_VBATPOR_OFS                 (0)                             /* !< VBATPOR Offset */
#define LFSS_LFSSRST_VBATPOR_MASK                ((uint32_t)0x00000001U)         /* !< If set, the register bit will
                                                                                    request a power on reset to the PMU
                                                                                    of the LFSS. */
#define LFSS_LFSSRST_VBATPOR_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing this value has no effect. */
#define LFSS_LFSSRST_VBATPOR_SET                 ((uint32_t)0x00000001U)         /* !< Request power on reset to the LFSS. */
/* LFSS_LFSSRST[KEY] Bits */
#define LFSS_LFSSRST_KEY_OFS                     (24)                            /* !< KEY Offset */
#define LFSS_LFSSRST_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0x12) to up2025-09-30
                                                                                    this register */
#define LFSS_LFSSRST_KEY_UNLOCK_W                ((uint32_t)0x12000000U)         /* !< This field must be written with
                                                                                    0x12 to be able to request the power
                                                                                    on reset. */

/* LFSS_RTCLOCK Bits */
/* LFSS_RTCLOCK[PROTECT] Bits */
#define LFSS_RTCLOCK_PROTECT_OFS                 (0)                             /* !< PROTECT Offset */
#define LFSS_RTCLOCK_PROTECT_MASK                ((uint32_t)0x00000001U)         /* !< If set, the register bit will
                                                                                    protect the CLKCTL, SEC, MIN, HOUR,
                                                                                    DAY, MON, YEAR and LFSSRST from
                                                                                    accidental writes. */
#define LFSS_RTCLOCK_PROTECT_CLR                 ((uint32_t)0x00000000U)         /* !< RTC counter is writable. */
#define LFSS_RTCLOCK_PROTECT_SET                 ((uint32_t)0x00000001U)         /* !< RTC counter is read only access. */
/* LFSS_RTCLOCK[KEY] Bits */
#define LFSS_RTCLOCK_KEY_OFS                     (24)                            /* !< KEY Offset */
#define LFSS_RTCLOCK_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0x22) to up2025-09-30
                                                                                    this register */
#define LFSS_RTCLOCK_KEY_UNLOCK_W                ((uint32_t)0x22000000U)         /* !< This field must be written with
                                                                                    0x22 to be able to up2025-09-30 any of the
                                                                                    bits. */

